// src/components/icons/BuildingIcon.jsx
import React from "react";

const BuildingIcon = ({ className = " text-gray-700" }) => (
  <svg
    viewBox="0 0 512 425"
    fill="currentColor"
    xmlns="http://www.w3.org/2000/svg"
    className={className}
  >
    <path d="M154.42 416.25h54.14v-93.06h94.88v93.06h54.14V107.53L253.62 33.72l-99.2 70.99v311.54zm211.91 0h115.61V195.72l-115.61-23.03v243.56zm0-266.43 138.47 28.2c5.72 2.13 8.63 8.5 6.5 14.21-2.13 5.72-8.49 8.63-14.21 6.5l-6.39-1.27V425H20.07V197.86l-5.16.87c-5.72 2.13-12.08-.78-14.21-6.5-2.13-5.71.78-12.08 6.5-14.21l138.46-24.37v-42.67l-9.1 6.52c-6.81 4.84-16.27 3.25-21.11-3.56-4.85-6.81-3.25-16.26 3.56-21.11L244.54 3.01c5.12-3.83 12.33-4.11 17.82-.21l125.81 89.32c6.81 4.85 8.4 14.3 3.56 21.11-4.85 6.81-14.3 8.41-21.11 3.56l-4.29-3.04v36.07z"/>
    {/* بقیه path ها هم اضافه میشن اینجا */}
  </svg>
);

export default BuildingIcon;
